
"_BASE_USED_" = "ru";
/* Use the _ADVANCED_EXTRA_WIDTH_ (if needed) to fit the method description properly */
"_ADVANCED_EXTRA_WIDTH_" = "50.0";
/* Use the _PREFERENCES_EXTRA_WIDTH_ (if needed) to fit the action to perform description properly */
"_PREFERENCES_EXTRA_WIDTH_" = "0.0";
"General" = "Общие";
"File Access" = "Доступ к файлам";
"Performance" = "Производительность";
"Finder Extension" = "Расширение для Finder";
"Love" = "Поддержать проект";
"OK" = "ОК";
"Done" = "Готово";
"Yes" = "Да";
"No" = "Нет";
"Don't show again" = "Больше не показывать";
"Set as default compressor" = "Установить в качестве системного архиватора";
"Not now" = "Не сейчас";
"Want to make Keka your default compressor?" = "Установить Keka в качестве системного архиватора?";
"This means that all the compatible files will be extracted with Keka by now. You can set this later in the Keka Preferences." = "Это значит, что все совместимые файлы далее будет распаковывать Keka. Это можно потом изменить в настройках Keka.";
"Really want to close Keka?" = "Действительно закрыть Keka?";
"The current operations will be canceled. If you choose to wait and quit Keka will exit when all work is done." = "Текущие операции будут отменены. Если вы выберете подождать и закрыть Keka, программа будет закрыта по завершении работы.";
"Password needed" = "Введите пароль";
"File \"%@\" needs a password to be extracted" = "Для распаковки файла \"%@\" требуется указать пароль";
"File \"%@\" needs a special encoding to be extracted" = "Файл \"%@\" требует особой кодировки для распаковки";
"Extraction of \"%@\" done" = "Распаковка файла \"%@\" завершена";
"Extraction of \"%@\" failed." = "Не удалось распаковать файл \"%@\".";
"Extraction of %i files done" = "Распаковка %i файлов завершена";
"Extraction complete" = "Распаковка завершена";
"Extraction fail" = "Распаковка не удалась";
"Compression complete" = "Сжатие завершено";
"File \"%@\" created" = "Файл \"%@\" создан";
"Compression fail" = "Сжатие не удалось";
"File \"%@\" cannot be created" = "Не удалось создать файл \"%@\" ";
"\n(using fallback folder)" = "\n(используя резервную папку)";
"Operation not implemented" = "Операция не реализована";
"Performing operation..." = "Выполнение операции...";
"Waiting..." = "Ожидание...";
"Extracting \"%@\"" = "Распаковка \"%@\"";
"Extracting \"%@...\"" = "Распаковка \"%@...\"";
"Creating %@ file..." = "Создание %@ файла...";
"Creating file \"%@\"" = "Создание файла \"%@\"";
"Creating file \"%@...\"" = "Создание файла \"%@...\"";
"Volume name:" = "Имя образа диска:";
"Select the encoding for \"%@\"" = "Выберите кодировку для \"%@\"";
"Time elapsed: %d:%@%d:%@%d hours%@" = "Прошло %d:%@%d:%@%d часов%@";
"Time elapsed: %d:%@%d minutes%@" = "Прошло %d:%@%d минут%@";
"Time elapsed: %d seconds%@" = "Прошло %d секунд%@";
"%.0f seconds" = "%.0f секунд";
"%i:%02i minutes" = "%i:%02i минут";
"%i:%02i:%02i hours" = "%i:%02i:%02i часов";
"Pause" = "Пауза";
"Continue" = "Продолжить";
"Operation paused" = "Операция приостановлена";
"Cancel" = "Отмена";
"Close" = "Закрыть";
"Operation failed" = "Операция не удалась";
"Operation failed with error code %d" = "Операция не удалась. Код ошибки %d";
"Choose a name and folder to start the compression" = "Выберите имя файла и папку, чтобы начать сжатие";
"Creation of \"%@\" failed" = "Не удалось создать \"%@\"";
"Creating \"%@\"" = "Создание \"%@\"";
"Preparing extraction..." = "Подготовка распаковки...";
"Choose a folder to extract this file" = "Укажите папку для распаковки файла";
"Choose where do you want to extract \"%@\"" = "Выберите, куда распаковать \"%@\"";
"Select all the volumes from \"%@\" or the folder that contains them" = "Выберите все тома \"%@\" или содержащую их папку";
"Select the folder that contains \"%@\"" = "Выберите папку, которая содержит \"%@\"";
"Extraction of \"%@\" failed" = "Не удалось распаковать \"%@\"";
"Keka - %i on queue" = "Keka - %i в очереди";
"Keka can't create this %@ image" = "Keka не удалось создать %@-образ";
"You can only create %@ images with a single folder. Try to put all your files in a folder and drop it to Keka to create the %@ image." = "%@-образ можно создать только из одной папки. Попробуйте поместить ваши файлы в одну папку и перетащить её в окно Keka.";
"Keka can't create this @% tarball" = "Keka не удалось создать TAR-архив @%";
"This operation is not supported on %@." = "Данная операция не поддерживается %@.";
"Compress \"%@\" in %@ to..." = "Сжать \"%@\" в %@ в...";
"Compress in %@ to..." = "Сжать в %@ в...";
"Save as:" = "Сохранить как:";
"Compress" = "Сжать";
"Extract \"%@\" to..." = "Распаковать \"%@\" в...";
"Extract as:" = "Распаковать как:";
"Extract" = "Распаковать";
"About %i seconds" = "Oколо %i секунд";
"About %i minutes" = "Oколо %i минут";
"About %i hours" = "Oколо %i часов";
"About %i days" = "Oколо %i дней";
"About %i weeks" = "Oколо %i недель";
"About %i months" = "Oколо %i месяцев ";
"About %i years" = "Oколо %i года";
"About a minute" = "Oколо минуты";
"About an hour" = "Oколо часа";
"About a day" = "Oколо дня";
"About a week" = "Oколо недели";
"About a month" = "Oколо месяца";
"About a year" = "Oколо года";
"Finishing..." = "Finishing...";
"Can't show progress time..." = "Невозможно показать оставшееся время...";
"Password for \"%@\"" = "Пароль для \"%@\"";
"Format" = "Формат";
"Method" = "Метод";
"Method:" = "Метод:";
"No compression" = "Без сжатия";
"Fastest, less compression" = "Самый быстрый (меньше сжатие)";
"Fast, less compression" = "Быстрый (меньше сжатие)";
"Normal" = "Обычный";
"Slow, more compression" = "Медленный (больше сжатие)";
"Slowest, more compression" = "Самый медленный (больше сжатие)";
"Compression" = "Сжатие";
"Extraction" = "Распаковка";
"Keka can't use the \"extlx.plist\" list, please get in contact with the developers.\n\nNow Keka will quit." = "Keka не может использовать список \"extlx.plist\"; пожалуйста, обратитесь к разработчикам.\n\nKeka завершает работу.";
"Keka is dying!" = "Keka умирает!";
"Ask each time" = "Спрашивать каждый раз";
"Next to original file" = "В папку с исходным файлом";
"Custom folder..." = "Выбрать папку...";
"Same as original file" = "Так же, как исходный файл";
"Custom name..." = "Указать имя...";
"Archive" = "Архив";
"Set as default folder" = "Установить как папку по умолчанию";
"Perform automatic action" = "Автовыбор нужного действия";
"Always compress" = "Всегда сжимать";
"Always extract" = "Всегда распаковывать";
"1.4 MB Floppy" = "1.4 MB дискета";
"650 MB CD" = "650 MB CD";
"700 MB CD" = "700 MB CD";
"4.7 GB DVD" = "4.7 GB DVD";
"Drop here to extract" = "Перетащите сюда для распаковки";
"Drop here to compress" = "Перетащите сюда для сжатия";
"Binary \"%@\" is not accessible" = "Бинарник \"%@\" недоступен";
"The first part \"%@\" can't be found" = "Первая часть \"%@\" не найдена";
"Unable to extract a folder" = "Невозможно извлечь папку";
"unknown" = "неизвестно";
"Unknown error" = "Неизвестная ошибка";
"Error code %d using \"%@\"\n%@" = "Код ошибки %d при использовании \"%@\"\n%@";
"Keka was unable to create the extraction package" = "Keka was unable to create the extraction package";
"No errors found" = "Ошибок не найдено";
"Minor error, the operation may be done well" = "Незначительная ошибка, операция может быть успешно продолжена";
"Fatal error" = "Критическая ошибка";
"CRC error occurred, maybe the file is corrupt" = "Ошибка CRC: возможно, файл повреждён";
"Attempt to modify an archive previously locked" = "Попытка модифицировать ранее заблокированный архив";
"Maybe you don't have permission to write or your disk is full" = "Возможно, у вас нет прав на запись, либо диск переполнен";
"Can't open the file, maybe you don't have read permission" = "Невозможно открыть файл. Возможно, у вас нет прав на чтение";
"Command line error, please contact with the developer" = "Ошибка командной строки. Пожалуйста, обратитесь к разработчику";
"Not enough memory. Try to close some programs and repeat the operation" = "Недостаточно памяти. Попробуйте закрыть другие программы и повторите операцию";
"Can't create the file, maybe you don't have permission or free space" = "Невозможно создать файл. Вероятно, у вас отсутствуют права на запись либо нет места на диске";
"Canceled manually" = "Принудительно отменена";
"Bad password, try again" = "Неверный пароль, попробуйте ещё раз";
"This archive is locked" = "Этот архив заблокирован";
"Write error. No permission? No space left?" = "Ошибка записи. Нет прав на запись? Нет места на диске?";
"Can't open the file, maybe it's not accessible" = "Невозможно открыть файл. Вероятно, он недоступен";
"No files matching the mask" = "Нет файлов, отвечающих маске запроса";
"There were some read errors" = "There were some read errors";
"Give access" = "Дать доступ";
"Just folder access" = "Только доступ к папке";
"Quit" = "Выход";
"More information" = "Больше информации";
"Keka needs file access" = "Keka требуется доступ к файлам";
"Give home access" = "Дать доступ к домашней папке";
"Customize" = "Настроить";
"Keka needs access to the source file/s." = "Keka needs access to the source file/s.";
"In order to work seamlessly with your files, Keka needs local access to the Mac disk." = "Чтобы беспрепятственно работать с вашими файлами, Keka нужен доступ к диску Mac.";
"\nSimply click on \"Give access to Keka\", your disk should already be selected." = "\nПросто нажмите на \"Дать доступ Keka\", ваш диск скорее всего будет уже выбран.";
"Give access to Keka" = "Дать доступ Keka";
"Full Mac access (Recommended)" = "Доступ ко всему Mac (Рекомендуется)";
"Home folder access" = "Доступ к домашней папке";
"External volumes access" = "Доступ к внешним хранилищам";
"Full Mac" = "Full Mac";
"Home folder" = "Home folder";
"External volumes" = "External volumes";
"Show in context menu" = "Show in context menu";
"External disk: %@" = "Внешний диск: %@";
"An extension is required" = "Требуется расширение";
"In order to set Keka as the default application, you need to install an extension. Click on \"More information\" to follow the required steps.\n\nRemember that you can always set Keka as the default application for any format using the Finder's \"Get Info\" panel." = "Чтобы установить Keka в качестве приложения по умолчанию, вам нужно установить расширение. Нажмите на \"Больше информации\" и следуйте требуемым шагам.\n\nПомните, что вы также можете установить Keka в качестве приложения по умолчанию для любого формата, используя панель \"Свойства\" в Finder.";
"Your installed extension is obsolete and you should update it." = "Your installed extension is obsolete and you should update it.";
"Update" = "Update";
"Cannot set Keka as default" = "Невозможно установить Keka по умолчанию";
"The intermediate application failed to launch. There is more information in the Console.app." = "Приложение-посредник не смогло запуститься. Подробнее в приложении Консоль.";
"The intermediate application returned an undefined code." = "Приложение-посредник вернуло неопределённый код.";
"Keka is now set as the default application for its known formats." = "Keka установлена в качестве приложения по умолчанию для известных ей форматов.";
"Keka set as default" = "Keka установлена по умолчанию";
"There were some errors while registering the formats. There is more information in the Console.app." = "При регистрации форматов произошли некоторые ошибки. Подробнее в приложении Консоль.";
"The intermediate application can't get access to Keka." = "Приложение посредник не смогло получить доступ к Keka.";
"The intermediate application can't find Keka." = "Приложение-посредник не может найти Keka.";
"Show in Finder" = "Показать в Finder";
"Delete" = "Удалить";
"Continue without encryption" = "Продолжить без шифрования";
"The password does not match" = "Пароль не совпадает";
"The password is not properly set and the file cannot be encrypted. You can cancel and set the password again or continue the process without encryption." = "Пароль не был установлен правильно, поэтому файл не может быть зашифрован. Вы можете отменить и установить пароль снова или продолжить процесс без шифрования.";
"Use legacy encryption" = "Использовать устаревшее шифрование";
"Using AES-256 encryption in ZIP" = "Используется AES-256 шифрование в ZIP";
"Note that most modern operating systems such as macOS (before macOS 11.0 Big Sur) or Windows do not support AES-256 encrypted ZIPs by default.\n\nYou can open those files easily with most third party extraction utilities." = "Обратите внимание, что большинство современных операционных систем, таких как macOS (до версии 11.0 Big Sur) или Windows, по умолчанию не поддерживают ZIP-файлы, зашифрованные с помощью AES-256.\n\nВы можете легко открыть эти файлы с помощью большинства сторонних утилит извлечения.";
"Cannot create the file" = "Невозможно создать файл";
"Keka has no file access to the source file/s\nGive it access when asked or manually in the Preferences" = "Keka не имеет доступа к исходному файлу/файлам\nВы можете предоставить доступ по запросу или вручную в Настройках.";
"Give access to the source/s folder/s" = "Дать доступ к исходной папке/папкам";
"Give access to the compressed file" = "Дать доступ к сжатому файлу";
"The extension is enabled" = "Расширение включено";
"The extension is disabled" = "Расширение отключено";
"Enable or disable the extension" = "Enable or disable the extension";
"Keka will decide whether to compress or uncompress based on file format and extension. This is the recommended option." = "Keka сама определит, сжимать или распаковывать файлы, основываясь на формате и расширении файла. Это рекомендованный вариант.";
"Keka will compress all files, even those that are already compressed. You can compress an already compressed file in automatic mode by dropping it to the bottom part of the drop zone." = "Keka будет сжимать все файлы, даже те, которые уже сжаты. Вы можете сжать уже сжатый файл в автоматическом режиме, поместив его в нижнюю часть зоны для сброса файлов.";
"Keka will try to extract all files. You can try to extract an unknown file in automatic mode by dropping it in the bottom part of the drop zone." = "Keka попытается извлечь все файлы. Вы можете попытаться извлечь неизвестный файл в автоматическом режиме, поместив его в нижнюю часть зоны для сброса файлов.";
"Show the operation log" = "Показать журнал операций";
"Unable to process tips" = "Невозможно обработать платежи";
"Already tipping a monthly %@" = "Вы уже даёте жертвуете %@ ежемесячно";
"Send a monthly %@ tip" = "Жертвовать %@ ежемесячно";
"Send a %@ tip" = "Единоразово пожертвовать %@";
"Give Keka some love ♥" = "Дайте Keka немного своей любви ♥";
"All extractions will be expanded at this location." = "Все извлечённые файлы будут сохраняться сюда.";
"All compressions will be stored at this location." = "Все сжатые файлы будут сохраняться сюда.";
"You'll be asked where to extract each operation." = "Keka будет каждый раз спрашивать, куда сохранять извлечённые файлы.";
"You'll be asked where to compress each operation." = "Keka будет каждый раз спрашивать, куда сохранять сжатые файлы.";
"If Keka has File Access it will execute the operation near the source file/s, otherwise it will ask for a location. You can set Keka's File Access in the Preferences tab so this option works properly." = "Если Keka имеет право доступа к файлам, она выполнит операцию рядом с исходным файлом/файлами, в противном случае она запросит расположение. Вы можете настроить доступ в панели \"Доступ к файлам\" в настройках Keka, чтобы эта опция работала правильно.";
"Keka has no file access to the destination folder so it needs to ask for a location.\nYou can add access to this and other folders in Keka's Preferences File Access pane." = "У Keka нет доступа к файлам в исходной папке, поэтому ей нужно запросить расположение.\nВы можете добавить доступ к этой и другим папкам в панели \"Доступ к файлам\" в настройках Keka.";
"The characters %@ are not compatible with the %@ format" = "Символы %@ не совместимы с форматом %@";
"The character %@ is not compatible with the %@ format" = "Символ %@ не совместим с форматом %@";
"Stop compressing" = "Stop compressing";
"Stop extracting" = "Stop extracting";
"Resume compressing" = "Resume compressing";
"Resume extracting" = "Resume extracting";
"Pause compressing" = "Pause compressing";
"Pause extracting" = "Pause extracting";
"Compression paused" = "Compression paused";
"Extraction paused" = "Extraction paused";
"Waiting for password" = "Waiting for password";
"On queue" = "On queue";
"Applying quarantine..." = "Applying quarantine...";

/*
// MAS tips
// Note this will be used in Apple's servers
// Apple needs to have MAS translated in this language so this strings can be used
// The language used in MAS/AppleID will be used in Keka's tip strings and may not match Keka's localization
// Note that the short string is limited to 30 characters and the long string is limited to 45 characters
// Emojis cannot be used in these strings :(
*/
"Monthly sip of coffee" = "Monthly sip of coffee";
"Gift Keka a sip of coffee each month" = "Gift Keka a sip of coffee each month";
"Monthly coffee" = "Monthly coffee";
"Gift Keka a coffee each month" = "Gift Keka a coffee each month";
"Monthly pair of coffees" = "Monthly pair of coffees";
"Gift Keka a couple coffees each month" = "Gift Keka a couple coffees each month";
"Monthly breakfast" = "Monthly breakfast";
"Gift Keka a breakfast each month" = "Gift Keka a breakfast each month";
"Tip a coffee" = "Tip a coffee";
"Tip Keka a coffee so it can stay awake" = "Tip Keka a coffee so it can stay awake";
"Tip a breakfast" = "Tip a breakfast";
"Tip Keka a breakfast so it can start fresh" = "Tip Keka a breakfast so it can start fresh";
"Tip a lunch" = "Tip a lunch";
"Tip Keka a lunch and feed it" = "Tip Keka a lunch and feed it";
"Tip a dinner" = "Tip a dinner";
"Tip Keka a dinner so it keeps rolling" = "Tip Keka a dinner so it keeps rolling";
"Tip a bunch of food" = "Tip a bunch of food";
"Tip Keka a new bunch of food to keep rolling" = "Tip Keka a new bunch of food to keep rolling";
